; ModuleID = 'main'
source_filename = "main"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%funcVal = type { void ()* }
%arrayType = type { %commonType, %commonType*, %commonType*, i64 }
%commonType = type { i8, i8, i8, i64, i32, %funcVal*, %funcVal*, i8*, { i8*, i64 }*, %uncommonType*, %commonType* }
%uncommonType = type { { i8*, i64 }*, { i8*, i64 }*, %methodSlice }
%methodSlice = type { %method*, i64, i64 }
%method = type { { i8*, i64 }*, { i8*, i64 }*, %commonType*, %commonType*, i8* }
%structType = type { %commonType, %structFieldSlice }
%structFieldSlice = type { %structField*, i64, i64 }
%structField = type { { i8*, i64 }*, { i8*, i64 }*, %commonType*, { i8*, i64 }*, i64 }
%ptrType = type { %commonType, %commonType* }
%interfaceType = type { %commonType, %imethodSlice }
%imethodSlice = type { %imethod*, i64, i64 }
%imethod = type { { i8*, i64 }*, { i8*, i64 }*, %commonType* }
%sliceType = type { %commonType, %commonType* }
%funcType = type { %commonType, i8, %typeSlice, %typeSlice }
%typeSlice = type { %commonType**, i64, i64 }

@__go_type_hash_empty_interface_descriptor = external global %funcVal
@__go_type_equal_empty_interface_descriptor = external global %funcVal
@__go_type_hash_interface_descriptor = external global %funcVal
@__go_type_equal_interface_descriptor = external global %funcVal
@__go_type_hash_string_descriptor = external global %funcVal

!0 = distinct !DICompileUnit(language: DW_LANG_Go, file: !1, producer: "llgo", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "go_programs/defer.go", directory: "/home/arpit/IIT/Project/cbmc_llvm/go")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 1, !"Debug Info Version", i32 3}
!5 = distinct !DISubprogram(name: "main.closeFile", linkageName: "main.closeFile", scope: null, file: !6, line: 41, type: !7, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!6 = !DIFile(filename: "go_programs/defer.go", directory: "")
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "void")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "File", baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*os.file}", size: 64, align: 64, elements: !13)
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "file", baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "file", baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{fd int; name string; dirinfo *os.dirInfo; nepipe int32}", size: 320, align: 64, elements: !18)
!18 = !{!19, !21, !28, !41}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "fd", baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !22, size: 128, align: 64, offset: 64)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", size: 128, align: 64, elements: !23)
!23 = !{!24, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "len", baseType: !20, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "dirInfo", baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{buf []byte; dir *syscall.DIR}", size: 256, align: 64, elements: !32)
!32 = !{!33, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "buf", baseType: !34, size: 192, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]byte", size: 192, align: 64, elements: !35)
!35 = !{!24, !27, !36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cap", baseType: !20, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "dir", baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{}", align: 8)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nepipe", baseType: !42, size: 32, align: 32, offset: 256)
!42 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!43 = !DILocation(line: 41, column: 6, scope: !5)
!44 = !DILocation(line: 42, column: 26, scope: !5)
!45 = !DILocation(line: 0, scope: !5)
!46 = !DILocation(line: 42, column: 16, scope: !5)
!47 = !DILocation(line: 43, column: 12, scope: !5)
!48 = distinct !DISubprogram(name: "main.createFile", linkageName: "main.createFile", scope: null, file: !6, line: 26, type: !49, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!49 = !DISubroutineType(types: !50)
!50 = !{!10, !22}
!51 = !DILocation(line: 26, column: 6, scope: !48)
!52 = !DILocation(line: 27, column: 27, scope: !48)
!53 = !DILocation(line: 0, scope: !48)
!54 = !DILocation(line: 27, column: 16, scope: !48)
!55 = !DILocation(line: 28, column: 24, scope: !48)
!56 = !DILocation(line: 29, column: 12, scope: !48)
!57 = !DILocation(line: 32, column: 5, scope: !48)
!58 = !DILocation(line: 30, column: 14, scope: !48)
!59 = distinct !DISubprogram(name: "main..import", linkageName: "main..import", scope: null, type: !60, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{!9}
!62 = !DILocation(line: 0, scope: !59)
!63 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !6, line: 14, type: !60, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!64 = !DILocation(line: 14, column: 6, scope: !63)
!65 = !DILocation(line: 21, column: 20, scope: !63)
!66 = !DILocation(line: 0, scope: !63)
!67 = !DILocation(line: 22, column: 5, scope: !63)
!68 = !DILocation(line: 23, column: 14, scope: !63)
!69 = distinct !DISubprogram(name: "main.writeFile", linkageName: "main.writeFile", scope: null, file: !6, line: 35, type: !7, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!70 = !DILocation(line: 35, column: 6, scope: !69)
!71 = !DILocation(line: 36, column: 26, scope: !69)
!72 = !DILocation(line: 0, scope: !69)
!73 = !DILocation(line: 36, column: 16, scope: !69)
!74 = !DILocation(line: 37, column: 27, scope: !69)
!75 = !DILocation(line: 37, column: 17, scope: !69)
!76 = distinct !DISubprogram(name: "os.close.S0_pN7_os.Filee", linkageName: "os.close.S0_pN7_os.Filee", scope: null, type: !77, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !84}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "interface{Error() string}", size: 128, align: 64, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", baseType: !25, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !25, size: 64, align: 64, offset: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*os.File}", size: 64, align: 64, elements: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !10, size: 64, align: 64)
!87 = !DILocation(line: 0, scope: !76)
!88 = !{!"branch_weights", i32 1, i32 1000}
!89 = distinct !DISubprogram(name: "os.pread.S0_pN7_os.Filee", linkageName: "os.pread.S0_pN7_os.Filee", scope: null, type: !90, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !84, !34, !96}
!92 = !DICompositeType(tag: DW_TAG_structure_type, size: 192, align: 64, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "n", baseType: !20, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "err", baseType: !79, size: 128, align: 64, offset: 64)
!96 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!97 = !DILocation(line: 0, scope: !89)
!98 = distinct !DISubprogram(name: "os.pwrite.S0_pN7_os.Filee", linkageName: "os.pwrite.S0_pN7_os.Filee", scope: null, type: !90, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!99 = !DILocation(line: 0, scope: !98)
!100 = distinct !DISubprogram(name: "os.read.S0_pN7_os.Filee", linkageName: "os.read.S0_pN7_os.Filee", scope: null, type: !101, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!101 = !DISubroutineType(types: !102)
!102 = !{!92, !84, !34}
!103 = !DILocation(line: 0, scope: !100)
!104 = distinct !DISubprogram(name: "os.readdir.S0_pN7_os.Filee", linkageName: "os.readdir.S0_pN7_os.Filee", scope: null, type: !105, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !84, !20}
!107 = !DICompositeType(tag: DW_TAG_structure_type, size: 320, align: 64, elements: !108)
!108 = !{!109, !115}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fi", baseType: !110, size: 192, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]os.FileInfo", size: 192, align: 64, elements: !111)
!111 = !{!112, !27, !36}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileInfo", baseType: !80)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "err", baseType: !79, size: 128, align: 64, offset: 192)
!116 = !DILocation(line: 0, scope: !104)
!117 = distinct !DISubprogram(name: "os.readdirnames.S0_pN7_os.Filee", linkageName: "os.readdirnames.S0_pN7_os.Filee", scope: null, type: !118, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !84, !20}
!120 = !DICompositeType(tag: DW_TAG_structure_type, size: 320, align: 64, elements: !121)
!121 = !{!122, !115}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "names", baseType: !123, size: 192, align: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]string", size: 192, align: 64, elements: !124)
!124 = !{!125, !27, !36}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!127 = !DILocation(line: 0, scope: !117)
!128 = distinct !DISubprogram(name: "os.seek.S0_pN7_os.Filee", linkageName: "os.seek.S0_pN7_os.Filee", scope: null, type: !129, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !84, !96, !20}
!131 = !DICompositeType(tag: DW_TAG_structure_type, size: 192, align: 64, elements: !132)
!132 = !{!133, !95}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ret", baseType: !96, size: 64, align: 64)
!134 = !DILocation(line: 0, scope: !128)
!135 = distinct !DISubprogram(name: "os.write.S0_pN7_os.Filee", linkageName: "os.write.S0_pN7_os.Filee", scope: null, type: !101, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!136 = !DILocation(line: 0, scope: !135)
!137 = distinct !DISubprogram(name: "Chdir.S0_pN7_os.Filee", linkageName: "Chdir.S0_pN7_os.Filee", scope: null, type: !77, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!138 = !DILocation(line: 0, scope: !137)
!139 = distinct !DISubprogram(name: "Chmod.S0_pN7_os.Filee", linkageName: "Chmod.S0_pN7_os.Filee", scope: null, type: !140, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!140 = !DISubroutineType(types: !141)
!141 = !{!79, !84, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileMode", baseType: !143)
!143 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!144 = !DILocation(line: 0, scope: !139)
!145 = distinct !DISubprogram(name: "Chown.S0_pN7_os.Filee", linkageName: "Chown.S0_pN7_os.Filee", scope: null, type: !146, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!146 = !DISubroutineType(types: !147)
!147 = !{!79, !84, !20, !20}
!148 = !DILocation(line: 0, scope: !145)
!149 = distinct !DISubprogram(name: "Close.S0_pN7_os.Filee", linkageName: "Close.S0_pN7_os.Filee", scope: null, type: !77, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!150 = !DILocation(line: 0, scope: !149)
!151 = distinct !DISubprogram(name: "Fd.S0_pN7_os.Filee", linkageName: "Fd.S0_pN7_os.Filee", scope: null, type: !152, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!152 = !DISubroutineType(types: !153)
!153 = !{!154, !84}
!154 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!155 = !DILocation(line: 0, scope: !151)
!156 = distinct !DISubprogram(name: "Name.S0_pN7_os.Filee", linkageName: "Name.S0_pN7_os.Filee", scope: null, type: !157, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!157 = !DISubroutineType(types: !158)
!158 = !{!22, !84}
!159 = !DILocation(line: 0, scope: !156)
!160 = distinct !DISubprogram(name: "Read.S0_pN7_os.Filee", linkageName: "Read.S0_pN7_os.Filee", scope: null, type: !101, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!161 = !DILocation(line: 0, scope: !160)
!162 = distinct !DISubprogram(name: "ReadAt.S0_pN7_os.Filee", linkageName: "ReadAt.S0_pN7_os.Filee", scope: null, type: !90, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!163 = !DILocation(line: 0, scope: !162)
!164 = distinct !DISubprogram(name: "Readdir.S0_pN7_os.Filee", linkageName: "Readdir.S0_pN7_os.Filee", scope: null, type: !105, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!165 = !DILocation(line: 0, scope: !164)
!166 = distinct !DISubprogram(name: "Readdirnames.S0_pN7_os.Filee", linkageName: "Readdirnames.S0_pN7_os.Filee", scope: null, type: !118, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!167 = !DILocation(line: 0, scope: !166)
!168 = distinct !DISubprogram(name: "Seek.S0_pN7_os.Filee", linkageName: "Seek.S0_pN7_os.Filee", scope: null, type: !129, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!169 = !DILocation(line: 0, scope: !168)
!170 = distinct !DISubprogram(name: "Stat.S0_pN7_os.Filee", linkageName: "Stat.S0_pN7_os.Filee", scope: null, type: !171, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !84}
!173 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !114, size: 128, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !79, size: 128, align: 64, offset: 128)
!177 = !DILocation(line: 0, scope: !170)
!178 = distinct !DISubprogram(name: "Sync.S0_pN7_os.Filee", linkageName: "Sync.S0_pN7_os.Filee", scope: null, type: !77, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!179 = !DILocation(line: 0, scope: !178)
!180 = distinct !DISubprogram(name: "Truncate.S0_pN7_os.Filee", linkageName: "Truncate.S0_pN7_os.Filee", scope: null, type: !181, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!181 = !DISubroutineType(types: !182)
!182 = !{!79, !84, !96}
!183 = !DILocation(line: 0, scope: !180)
!184 = distinct !DISubprogram(name: "Write.S0_pN7_os.Filee", linkageName: "Write.S0_pN7_os.Filee", scope: null, type: !101, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!185 = !DILocation(line: 0, scope: !184)
!186 = distinct !DISubprogram(name: "WriteAt.S0_pN7_os.Filee", linkageName: "WriteAt.S0_pN7_os.Filee", scope: null, type: !90, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!187 = !DILocation(line: 0, scope: !186)
!188 = distinct !DISubprogram(name: "WriteString.S0_pN7_os.Filee", linkageName: "WriteString.S0_pN7_os.Filee", scope: null, type: !189, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!189 = !DISubroutineType(types: !190)
!190 = !{!92, !84, !22}
!191 = !DILocation(line: 0, scope: !188)
!192 = distinct !DISubprogram(name: "os.close.pS0_pN7_os.Filee", linkageName: "os.close.pS0_pN7_os.Filee", scope: null, type: !193, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!193 = !DISubroutineType(types: !194)
!194 = !{!79, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!196 = !DILocation(line: 0, scope: !192)
!197 = distinct !DISubprogram(name: "os.pread.pS0_pN7_os.Filee", linkageName: "os.pread.pS0_pN7_os.Filee", scope: null, type: !198, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!198 = !DISubroutineType(types: !199)
!199 = !{!92, !195, !34, !96}
!200 = !DILocation(line: 0, scope: !197)
!201 = distinct !DISubprogram(name: "os.pwrite.pS0_pN7_os.Filee", linkageName: "os.pwrite.pS0_pN7_os.Filee", scope: null, type: !198, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!202 = !DILocation(line: 0, scope: !201)
!203 = distinct !DISubprogram(name: "os.read.pS0_pN7_os.Filee", linkageName: "os.read.pS0_pN7_os.Filee", scope: null, type: !204, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!204 = !DISubroutineType(types: !205)
!205 = !{!92, !195, !34}
!206 = !DILocation(line: 0, scope: !203)
!207 = distinct !DISubprogram(name: "os.readdir.pS0_pN7_os.Filee", linkageName: "os.readdir.pS0_pN7_os.Filee", scope: null, type: !208, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!208 = !DISubroutineType(types: !209)
!209 = !{!107, !195, !20}
!210 = !DILocation(line: 0, scope: !207)
!211 = distinct !DISubprogram(name: "os.readdirnames.pS0_pN7_os.Filee", linkageName: "os.readdirnames.pS0_pN7_os.Filee", scope: null, type: !212, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!212 = !DISubroutineType(types: !213)
!213 = !{!120, !195, !20}
!214 = !DILocation(line: 0, scope: !211)
!215 = distinct !DISubprogram(name: "os.seek.pS0_pN7_os.Filee", linkageName: "os.seek.pS0_pN7_os.Filee", scope: null, type: !216, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!216 = !DISubroutineType(types: !217)
!217 = !{!131, !195, !96, !20}
!218 = !DILocation(line: 0, scope: !215)
!219 = distinct !DISubprogram(name: "os.write.pS0_pN7_os.Filee", linkageName: "os.write.pS0_pN7_os.Filee", scope: null, type: !204, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
