; ModuleID = 'main'
source_filename = "main"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%funcVal = type { void ()* }
%structType = type { %commonType, %structFieldSlice }
%commonType = type { i8, i8, i8, i64, i32, %funcVal*, %funcVal*, i8*, { i8*, i64 }*, %uncommonType*, %commonType* }
%uncommonType = type { { i8*, i64 }*, { i8*, i64 }*, %methodSlice }
%methodSlice = type { %method*, i64, i64 }
%method = type { { i8*, i64 }*, { i8*, i64 }*, %commonType*, %commonType*, i8* }
%structFieldSlice = type { %structField*, i64, i64 }
%structField = type { { i8*, i64 }*, { i8*, i64 }*, %commonType*, { i8*, i64 }*, i64 }
%arrayType = type { %commonType, %commonType*, %commonType*, i64 }
%ptrType = type { %commonType, %commonType* }
%interfaceType = type { %commonType, %imethodSlice }
%imethodSlice = type { %imethod*, i64, i64 }
%imethod = type { { i8*, i64 }*, { i8*, i64 }*, %commonType* }
%sliceType = type { %commonType, %commonType* }
%funcType = type { %commonType, i8, %typeSlice, %typeSlice }
%typeSlice = type { %commonType**, i64, i64 }

@__go_type_hash_empty_interface_descriptor = external global %funcVal
@__go_type_equal_empty_interface_descriptor = external global %funcVal
@__go_type_hash_interface_descriptor = external global %funcVal
@__go_type_equal_interface_descriptor = external global %funcVal
@__go_type_hash_string_descriptor = external global %funcVal

!0 = distinct !DICompileUnit(language: DW_LANG_Go, file: !1, producer: "llgo", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "go_programs/writing-files.go", directory: "/home/arpit/IIT/Project/cbmc_llvm/go")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 1, !"Debug Info Version", i32 3}
!5 = distinct !DISubprogram(name: "main.check", linkageName: "main.check", scope: null, file: !6, line: 13, type: !7, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!6 = !DIFile(filename: "go_programs/writing-files.go", directory: "")
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "void")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "error", baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "interface{Error() string}", size: 128, align: 64, elements: !12)
!12 = !{!13, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "type", baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !14, size: 64, align: 64, offset: 64)
!17 = !DILocation(line: 13, column: 6, scope: !5)
!18 = !DILocation(line: 14, column: 10, scope: !5)
!19 = !DILocation(line: 0, scope: !5)
!20 = !DILocation(line: 15, column: 14, scope: !5)
!21 = distinct !DISubprogram(name: "main..import", linkageName: "main..import", scope: null, type: !22, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!22 = !DISubroutineType(types: !23)
!23 = !{!9}
!24 = !DILocation(line: 0, scope: !21)
!25 = distinct !DISubprogram(name: "main.main", linkageName: "main.main", scope: null, file: !6, line: 19, type: !22, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!26 = !DILocation(line: 19, column: 6, scope: !25)
!27 = !DILocation(line: 23, column: 17, scope: !25)
!28 = !DILocation(line: 24, column: 28, scope: !25)
!29 = !DILocation(line: 0, scope: !25)
!30 = !DILocation(line: 25, column: 10, scope: !25)
!31 = !DILocation(line: 28, column: 24, scope: !25)
!32 = !DILocation(line: 29, column: 10, scope: !25)
!33 = !DILocation(line: 33, column: 5, scope: !25)
!34 = !DILocation(line: 36, column: 17, scope: !25)
!35 = !DILocation(line: 36, column: 18, scope: !25)
!36 = !DILocation(line: 36, column: 23, scope: !25)
!37 = !DILocation(line: 36, column: 28, scope: !25)
!38 = !DILocation(line: 36, column: 33, scope: !25)
!39 = !DILocation(line: 36, column: 38, scope: !25)
!40 = !DILocation(line: 37, column: 23, scope: !25)
!41 = !DILocation(line: 38, column: 10, scope: !25)
!42 = !DILocation(line: 39, column: 38, scope: !25)
!43 = !DILocation(line: 39, column: 36, scope: !25)
!44 = !DILocation(line: 39, column: 15, scope: !25)
!45 = !DILocation(line: 42, column: 29, scope: !25)
!46 = !DILocation(line: 43, column: 38, scope: !25)
!47 = !DILocation(line: 43, column: 36, scope: !25)
!48 = !DILocation(line: 43, column: 15, scope: !25)
!49 = !DILocation(line: 46, column: 11, scope: !25)
!50 = !DILocation(line: 50, column: 25, scope: !25)
!51 = !DILocation(line: 51, column: 29, scope: !25)
!52 = !DILocation(line: 52, column: 38, scope: !25)
!53 = !DILocation(line: 52, column: 36, scope: !25)
!54 = !DILocation(line: 52, column: 15, scope: !25)
!55 = !DILocation(line: 56, column: 12, scope: !25)
!56 = distinct !DISubprogram(name: "os.close.S0_pN7_os.Filee", linkageName: "os.close.S0_pN7_os.Filee", scope: null, type: !57, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!57 = !DISubroutineType(types: !58)
!58 = !{!10, !59}
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*os.File}", size: 64, align: 64, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "File", baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*os.file}", size: 64, align: 64, elements: !65)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "file", baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "file", baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{fd int; name string; dirinfo *os.dirInfo; nepipe int32}", size: 320, align: 64, elements: !70)
!70 = !{!71, !73, !78, !91}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fd", baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", baseType: !74, size: 128, align: 64, offset: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", size: 128, align: 64, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !14, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", baseType: !72, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", baseType: !79, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "dirInfo", baseType: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{buf []byte; dir *syscall.DIR}", size: 256, align: 64, elements: !82)
!82 = !{!83, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "buf", baseType: !84, size: 192, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]byte", size: 192, align: 64, elements: !85)
!85 = !{!76, !77, !86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cap", baseType: !72, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dir", baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{}", align: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nepipe", baseType: !92, size: 32, align: 32, offset: 256)
!92 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!93 = !DILocation(line: 0, scope: !56)
!94 = !{!"branch_weights", i32 1, i32 1000}
!95 = distinct !DISubprogram(name: "os.pread.S0_pN7_os.Filee", linkageName: "os.pread.S0_pN7_os.Filee", scope: null, type: !96, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !59, !84, !102}
!98 = !DICompositeType(tag: DW_TAG_structure_type, size: 192, align: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "n", baseType: !72, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "err", baseType: !10, size: 128, align: 64, offset: 64)
!102 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!103 = !DILocation(line: 0, scope: !95)
!104 = distinct !DISubprogram(name: "os.pwrite.S0_pN7_os.Filee", linkageName: "os.pwrite.S0_pN7_os.Filee", scope: null, type: !96, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!105 = !DILocation(line: 0, scope: !104)
!106 = distinct !DISubprogram(name: "os.read.S0_pN7_os.Filee", linkageName: "os.read.S0_pN7_os.Filee", scope: null, type: !107, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!107 = !DISubroutineType(types: !108)
!108 = !{!98, !59, !84}
!109 = !DILocation(line: 0, scope: !106)
!110 = distinct !DISubprogram(name: "os.readdir.S0_pN7_os.Filee", linkageName: "os.readdir.S0_pN7_os.Filee", scope: null, type: !111, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !59, !72}
!113 = !DICompositeType(tag: DW_TAG_structure_type, size: 320, align: 64, elements: !114)
!114 = !{!115, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fi", baseType: !116, size: 192, align: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]os.FileInfo", size: 192, align: 64, elements: !117)
!117 = !{!118, !77, !86}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileInfo", baseType: !11)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "err", baseType: !10, size: 128, align: 64, offset: 192)
!122 = !DILocation(line: 0, scope: !110)
!123 = distinct !DISubprogram(name: "os.readdirnames.S0_pN7_os.Filee", linkageName: "os.readdirnames.S0_pN7_os.Filee", scope: null, type: !124, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !59, !72}
!126 = !DICompositeType(tag: DW_TAG_structure_type, size: 320, align: 64, elements: !127)
!127 = !{!128, !121}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "names", baseType: !129, size: 192, align: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]string", size: 192, align: 64, elements: !130)
!130 = !{!131, !77, !86}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!133 = !DILocation(line: 0, scope: !123)
!134 = distinct !DISubprogram(name: "os.seek.S0_pN7_os.Filee", linkageName: "os.seek.S0_pN7_os.Filee", scope: null, type: !135, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !59, !102, !72}
!137 = !DICompositeType(tag: DW_TAG_structure_type, size: 192, align: 64, elements: !138)
!138 = !{!139, !101}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ret", baseType: !102, size: 64, align: 64)
!140 = !DILocation(line: 0, scope: !134)
!141 = distinct !DISubprogram(name: "os.write.S0_pN7_os.Filee", linkageName: "os.write.S0_pN7_os.Filee", scope: null, type: !107, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!142 = !DILocation(line: 0, scope: !141)
!143 = distinct !DISubprogram(name: "Chdir.S0_pN7_os.Filee", linkageName: "Chdir.S0_pN7_os.Filee", scope: null, type: !57, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!144 = !DILocation(line: 0, scope: !143)
!145 = distinct !DISubprogram(name: "Chmod.S0_pN7_os.Filee", linkageName: "Chmod.S0_pN7_os.Filee", scope: null, type: !146, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!146 = !DISubroutineType(types: !147)
!147 = !{!10, !59, !148}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileMode", baseType: !149)
!149 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!150 = !DILocation(line: 0, scope: !145)
!151 = distinct !DISubprogram(name: "Chown.S0_pN7_os.Filee", linkageName: "Chown.S0_pN7_os.Filee", scope: null, type: !152, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!152 = !DISubroutineType(types: !153)
!153 = !{!10, !59, !72, !72}
!154 = !DILocation(line: 0, scope: !151)
!155 = distinct !DISubprogram(name: "Close.S0_pN7_os.Filee", linkageName: "Close.S0_pN7_os.Filee", scope: null, type: !57, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!156 = !DILocation(line: 0, scope: !155)
!157 = distinct !DISubprogram(name: "Fd.S0_pN7_os.Filee", linkageName: "Fd.S0_pN7_os.Filee", scope: null, type: !158, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !59}
!160 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!161 = !DILocation(line: 0, scope: !157)
!162 = distinct !DISubprogram(name: "Name.S0_pN7_os.Filee", linkageName: "Name.S0_pN7_os.Filee", scope: null, type: !163, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!163 = !DISubroutineType(types: !164)
!164 = !{!74, !59}
!165 = !DILocation(line: 0, scope: !162)
!166 = distinct !DISubprogram(name: "Read.S0_pN7_os.Filee", linkageName: "Read.S0_pN7_os.Filee", scope: null, type: !107, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!167 = !DILocation(line: 0, scope: !166)
!168 = distinct !DISubprogram(name: "ReadAt.S0_pN7_os.Filee", linkageName: "ReadAt.S0_pN7_os.Filee", scope: null, type: !96, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!169 = !DILocation(line: 0, scope: !168)
!170 = distinct !DISubprogram(name: "Readdir.S0_pN7_os.Filee", linkageName: "Readdir.S0_pN7_os.Filee", scope: null, type: !111, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!171 = !DILocation(line: 0, scope: !170)
!172 = distinct !DISubprogram(name: "Readdirnames.S0_pN7_os.Filee", linkageName: "Readdirnames.S0_pN7_os.Filee", scope: null, type: !124, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!173 = !DILocation(line: 0, scope: !172)
!174 = distinct !DISubprogram(name: "Seek.S0_pN7_os.Filee", linkageName: "Seek.S0_pN7_os.Filee", scope: null, type: !135, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!175 = !DILocation(line: 0, scope: !174)
!176 = distinct !DISubprogram(name: "Stat.S0_pN7_os.Filee", linkageName: "Stat.S0_pN7_os.Filee", scope: null, type: !177, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !59}
!179 = !DICompositeType(tag: DW_TAG_structure_type, size: 256, align: 64, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !120, size: 128, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_", baseType: !10, size: 128, align: 64, offset: 128)
!183 = !DILocation(line: 0, scope: !176)
!184 = distinct !DISubprogram(name: "Sync.S0_pN7_os.Filee", linkageName: "Sync.S0_pN7_os.Filee", scope: null, type: !57, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!185 = !DILocation(line: 0, scope: !184)
!186 = distinct !DISubprogram(name: "Truncate.S0_pN7_os.Filee", linkageName: "Truncate.S0_pN7_os.Filee", scope: null, type: !187, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!187 = !DISubroutineType(types: !188)
!188 = !{!10, !59, !102}
!189 = !DILocation(line: 0, scope: !186)
!190 = distinct !DISubprogram(name: "Write.S0_pN7_os.Filee", linkageName: "Write.S0_pN7_os.Filee", scope: null, type: !107, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!191 = !DILocation(line: 0, scope: !190)
!192 = distinct !DISubprogram(name: "WriteAt.S0_pN7_os.Filee", linkageName: "WriteAt.S0_pN7_os.Filee", scope: null, type: !96, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!193 = !DILocation(line: 0, scope: !192)
!194 = distinct !DISubprogram(name: "WriteString.S0_pN7_os.Filee", linkageName: "WriteString.S0_pN7_os.Filee", scope: null, type: !195, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!195 = !DISubroutineType(types: !196)
!196 = !{!98, !59, !74}
!197 = !DILocation(line: 0, scope: !194)
!198 = distinct !DISubprogram(name: "os.close.pS0_pN7_os.Filee", linkageName: "os.close.pS0_pN7_os.Filee", scope: null, type: !199, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!199 = !DISubroutineType(types: !200)
!200 = !{!10, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!202 = !DILocation(line: 0, scope: !198)
!203 = distinct !DISubprogram(name: "os.pread.pS0_pN7_os.Filee", linkageName: "os.pread.pS0_pN7_os.Filee", scope: null, type: !204, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!204 = !DISubroutineType(types: !205)
!205 = !{!98, !201, !84, !102}
!206 = !DILocation(line: 0, scope: !203)
!207 = distinct !DISubprogram(name: "os.pwrite.pS0_pN7_os.Filee", linkageName: "os.pwrite.pS0_pN7_os.Filee", scope: null, type: !204, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!208 = !DILocation(line: 0, scope: !207)
!209 = distinct !DISubprogram(name: "os.read.pS0_pN7_os.Filee", linkageName: "os.read.pS0_pN7_os.Filee", scope: null, type: !210, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!210 = !DISubroutineType(types: !211)
!211 = !{!98, !201, !84}
!212 = !DILocation(line: 0, scope: !209)
!213 = distinct !DISubprogram(name: "os.readdir.pS0_pN7_os.Filee", linkageName: "os.readdir.pS0_pN7_os.Filee", scope: null, type: !214, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!214 = !DISubroutineType(types: !215)
!215 = !{!113, !201, !72}
!216 = !DILocation(line: 0, scope: !213)
!217 = distinct !DISubprogram(name: "os.readdirnames.pS0_pN7_os.Filee", linkageName: "os.readdirnames.pS0_pN7_os.Filee", scope: null, type: !218, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!218 = !DISubroutineType(types: !219)
!219 = !{!126, !201, !72}
!220 = !DILocation(line: 0, scope: !217)
!221 = distinct !DISubprogram(name: "os.seek.pS0_pN7_os.Filee", linkageName: "os.seek.pS0_pN7_os.Filee", scope: null, type: !222, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
!222 = !DISubroutineType(types: !223)
!223 = !{!137, !201, !102, !72}
!224 = !DILocation(line: 0, scope: !221)
!225 = distinct !DISubprogram(name: "os.write.pS0_pN7_os.Filee", linkageName: "os.write.pS0_pN7_os.Filee", scope: null, type: !210, isLocal: false, isDefinition: true, isOptimized: false, unit: !0, variables: !2)
